app/controllers/score_controller.rb

INSERT INTO "scores" ("user_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 25], ["score", 11], ["created_at", "2019-06-07 20:24:56.924428"], ["updated_at", "2019-06-07 20:24:56.924428"]]
---
    def set_player_score
         score_permitted_params = score_params
         new_player_score = Score.create(score: score_permitted_params[:score], user_id: score_permitted_params[:id].to_i)