app/controllers/user_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "Tom"], ["created_at", "2019-06-07 16:41:20.223465"], ["updated_at", "2019-06-07 16:41:20.223465"]]
---
    def create_account
        new_user = User.create(authenticate_params[:user])